Pandas
Pandas is an open source, high-performance, easy-to-use data structures and data analysis tools for the Python programming language. Pandas adds data structures and tools designed to work with table-like data which is Series and Data Frames. Pandas provides tools for data manipulation:

reshaping
merging
sorting
slicing
aggregation
imputation.

In [44]:
import pandas as pd # importing pandas as pd
import numpy  as np # importing numpy as np

Creating Pandas Series with Default Index

In [45]:
nums = [1,2,3,4,5]

s= pd.Series(nums)
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [46]:
#create pandas to give the customes indexs
s=pd.Series(nums,index=[1,2,3,4,5])
print(s)

1    1
2    2
3    3
4    4
5    5
dtype: int64

In [47]:
fruits = ['Orange','Banana','Mango']
fruits = pd.Series(fruits, index=[1, 2, 3])
print(fruits)

1    Orange
2    Banana
3     Mango
dtype: object

Creating Pandas Series from a Dictionary

In [48]:
dct = {'name':'Asabeneh','country':'Finland','city':'Helsinki'}

In [49]:
s=pd.Series(dct)
print(s)

name       Asabeneh
country     Finland
city       Helsinki
dtype: object

In [50]:
#create the pandas to constant pandas series
s=pd.Series(10, index=[1,2,3,4])
print(s)

1    10
2    10
3    10
4    10
dtype: int64

In [51]:
s = pd.Series(np.linspace(5, 20, 10)) # linspace(starting, end, items)
print(s)

0     5.000000
1     6.666667
2     8.333333
3    10.000000
4    11.666667
5    13.333333
6    15.000000
7    16.666667
8    18.333333
9    20.000000
dtype: float64

Dataframe creation

In [52]:
data = [
    ['Asabeneh', 'Finland', 'Helsink'], 
    ['David', 'UK', 'London'],
    ['John', 'Sweden', 'Stockholm']
]

df = pd.DataFrame(data, columns=['Name','Country','City'])
print(df)

       Name  Country       City
0  Asabeneh  Finland    Helsink
1     David       UK     London
2      John   Sweden  Stockholm

In [53]:
data = {'Name': ['Asabeneh', 'David', 'John'], 'Country':[
    'Finland', 'UK', 'Sweden'], 'City': ['Helsiki', 'London', 'Stockholm']}

df = pd.DataFrame(data)
print(df)

       Name  Country       City
0  Asabeneh  Finland    Helsiki
1     David       UK     London
2      John   Sweden  Stockholm

In [54]:
df= pd.read_csv('weight-height.csv')
print(df)

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [55]:
print(df.head())

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [56]:
print(df.tail())

      Gender     Height      Weight
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

In [57]:
print(df.shape)

(10000, 3)

In [58]:
print(df.columns)

Index(['Gender', 'Height', 'Weight'], dtype='object')

In [59]:
heights= df['Height']
print(heights)

0       73.847017
1       68.781904
2       74.110105
3       71.730978
4       69.881796
          ...
9995    66.172652
9996    67.067155
9997    63.867992
9998    69.034243
9999    61.944246
Name: Height, Length: 10000, dtype: float64

In [60]:
weights = df['Weight']
print(weights)

0       241.893563
1       162.310473
2       212.740856
3       220.042470
4       206.349801
           ...
9995    136.777454
9996    170.867906
9997    128.475319
9998    163.852461
9999    113.649103
Name: Weight, Length: 10000, dtype: float64

In [61]:
print(len(heights) == len(weights))

True

In [62]:
#give the statistical values
print(heights.describe())

count    10000.000000
mean        66.367560
std          3.847528
min         54.263133
25%         63.505620
50%         66.318070
75%         69.174262
max         78.998742
Name: Height, dtype: float64

In [63]:
print(df.describe())

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

In [64]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Gender  10000 non-null  object
 1   Height  10000 non-null  float64
 2   Weight  10000 non-null  float64
dtypes: float64(2), object(1)
memory usage: 234.5+ KB
None

In [65]:
#create a Dataframe

data = [
    {"Name": "Asabeneh", "Country":"Finland","City":"Helsinki"},
    {"Name": "David", "Country":"UK","City":"London"},
    {"Name": "John", "Country":"Sweden","City":"Stockholm"}]

df= pd.DataFrame(data)
print(df)

       Name  Country       City
0  Asabeneh  Finland   Helsinki
1     David       UK     London
2      John   Sweden  Stockholm

In [66]:
#Add the coloum to the dataframe
# code = [10,20,30]
# df['country_code'] = code
# print(df)

weights = [74, 78, 69]
df['Weight'] = weights
df

       Name  Country       City  Weight
0  Asabeneh  Finland   Helsinki      74
1     David       UK     London      78
2      John   Sweden  Stockholm      69

In [67]:
# rate =[10,9,7]
# df['Rate'] = rate
# print(df)

heights = [173, 175, 169]
df['Height'] = heights
df

       Name  Country       City  Weight  Height
0  Asabeneh  Finland   Helsinki      74     173
1     David       UK     London      78     175
2      John   Sweden  Stockholm      69     169

In [68]:
#modify the coloum

df['Height'] = df['Height'] * 0.01
df

       Name  Country       City  Weight  Height
0  Asabeneh  Finland   Helsinki      74    1.73
1     David       UK     London      78    1.75
2      John   Sweden  Stockholm      69    1.69

In [69]:
# Using functions makes our code clean, but you can calculate the bmi without one

def calculate_bmi():
    weight =df['Weight']
    height = df['Height']
    bmi = []
    for w,h in zip(weight,height):
        b = w/(h*h)
        bmi.append(b)
    return bmi
bmi = calculate_bmi()

In [70]:
df['BMI'] = bmi
df

       Name  Country       City  Weight  Height        BMI
0  Asabeneh  Finland   Helsinki      74    1.73  24.725183
1     David       UK     London      78    1.75  25.469388
2      John   Sweden  Stockholm      69    1.69  24.158818

In [71]:
# Formating DataFrame columns

# The BMI column values of the DataFrame are float with many significant digits after decimal. Let's change it to one significant digit after point.

df['BMI'] = round(df['BMI'],1)
df

       Name  Country       City  Weight  Height   BMI
0  Asabeneh  Finland   Helsinki      74    1.73  24.7
1     David       UK     London      78    1.75  25.5
2      John   Sweden  Stockholm      69    1.69  24.2

In [80]:
birth_year = ['1969', '1999', '2002']
current_year = pd.Series(2025,index=[0,1,2])
df['Birth_Year'] = birth_year
df['Current_Year'] = current_year
df

,Name,Country,City,Weight,Height,BMI,Birth_Year,Current_Year,Age
0,Asabeneh,Finland,Helsinki,74,1.73,24.7,1969,2025,24
1,David,UK,London,78,1.75,25.5,1999,2025,26
2,John,Sweden,Stockholm,69,1.69,24.2,2002,2025,23

In [81]:
print(df['Weight'].dtype)

int64

In [82]:
print(df['Birth_Year'].dtype)

object

In [83]:
df['Birth_Year'] = df['Birth_Year'].astype(dtype=int)
print(df['Birth_Year'].dtype)

int64

In [84]:
df['Current_Year'] = df['Current_Year'].astype(dtype=int)
print(df['Current_Year'].dtype)

int64

In [85]:
age = df['Current_Year'] - df['Birth_Year']
df['Age'] = age
df

,Name,Country,City,Weight,Height,BMI,Birth_Year,Current_Year,Age
0,Asabeneh,Finland,Helsinki,74,1.73,24.7,1969,2025,56
1,David,UK,London,78,1.75,25.5,1999,2025,26
2,John,Sweden,Stockholm,69,1.69,24.2,2002,2025,23

In [88]:
mean = (35 + 30)/2
print('mean',mean)

mean 32.5

In [92]:
print(df[df['Age'] > 30])

       Name  Country      City  Weight  Height   BMI  Birth_Year  \
0  Asabeneh  Finland  Helsinki      74    1.73  24.7        1969

   Current_Year  Age
0          2025   56

In [93]:
print(df[df['Age']< 30])

    Name Country       City  Weight  Height   BMI  Birth_Year  Current_Year  \
1  David      UK     London      78    1.75  25.5        1999          2025
2   John  Sweden  Stockholm      69    1.69  24.2        2002          2025

   Age
1   26
2   23